Revit 2026 API

# IndexBuffer Class

---

A buffer that stores vertex indices for rendering.

SystemObject Autodesk.Revit.DB.DirectContext3DIndexBuffer

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexBuffer : IDisposable
```
```vb
Public Class IndexBuffer
	Implements IDisposable
```
```cpp
public ref class IndexBuffer : IDisposable
```
```fsharp
type IndexBuffer =
    class
        interface IDisposable
    end
```

The IndexBuffer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IndexBuffer | Constructs the index buffer with the given capacity, measured in short integers. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IndexBuffer |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIndexStreamLine | Gets a stream that can be used to write IndexLine segment primitives into the buffer. |
|  | GetIndexStreamPoint | Gets a stream that can be used to write IndexPoint primitives into the buffer. |
|  | GetIndexStreamTriangle | Gets a stream that can be used to write IndexTriangle primitives into the buffer. |
|  | GetMappedHandle | Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Tests whether the buffer is valid for rendering. |
|  | Map | Maps a portion of the index buffer into memory, so that indices can be written into it. see IndexStream. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | Unmap | Unmaps the buffer so that it can be used for rendering. |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace